#include<stdio.h>

//%d,%u,%o 如果大写%D ->D  %U->U  %O->O
//%C,%c都是一样
//%S-%F->什么都不输出
//%E,%X,%E指数会大写，%X十六进制的字母会大写。
//%G，  %g可以大写，按照%f正常是输出，按照%e，指数为大写

void demo01()
{
   //%g可以大写，按照%f正常是输出，按照%e，指数为大写
	printf("\n%e,%f,%g", 10000000.0, 10000000.0, 10000000.0);
	printf("\n%e,%f,%g", 100.1234567, 100.1234567, 100.1234567);
	printf("\n%e,%f,%G", 10000000.0, 10000000.0, 10000000.0);
	printf("\n%e,%f,%G", 100.1234567, 100.1234567, 100.1234567);
}

void demo02()   //打印的时候，要一一对应
{
	printf("%d,%d", 1, 2, 3, 4, 5, 6); //输出表多了会被忽略
	printf("\n");
	printf("%d,%d,%d,%d,%d", 1, 2);	//控制项多了，会打印出不定值
}

void demo03()
{
	printf("C:\\Windows");
	printf("\'A\'");
	printf("\"A\"");
}

void demo04()
{
	//printf打印的时候，类型与数据要匹配，不匹配就会出现转换错误
	printf("%d\n", 100000.0);
	printf("%f", 100000);
}

void main()
{
	demo01();
	demo02();
	demo03();
	demo04();

	getchar();
}